maraswrona/comfoair-esp32/components/comfoair/comfoair.h
#pragma once
#include <esp32_can.h>

#include "esphome/components/api/custom_api_device.h"
#include "esphome/core/component.h"
#include "esphome/components/sensor/sensor.h"
#include "esphome/components/binary_sensor/binary_sensor.h"
#include "esphome/components/text_sensor/text_sensor.h"
#include "esphome/components/climate/climate.h"
#include "esphome/components/climate/climate_mode.h"
#include "esphome/components/climate/climate_traits.h"
#include "CanAddress.h"
#include "commands.h"
#define amin(a,b) ((a) < (b) ? (a): (b))

namespace esphome {
namespace comfoair {

static const char *TAG = "comfoair.component";

template <typename T, typename CONV>
class ComfoSensor {
  public:
    T* sensor;
    float divider;
    CONV conversion;
};

class Comfoair: public Component, public climate::Climate, public esphome::api::CustomAPIDevice {

 public:
  void set_rx(int rx) { rx_ = rx; }
  void set_tx(int tx) { tx_ = tx; }
  void register_sensor(sensor::Sensor *obj, std::string key, int PDOID, int conversionType, int divider) {
    ComfoSensor<sensor::Sensor, int> *cs = new ComfoSensor<sensor::Sensor, int>();
    cs->sensor = obj;
    cs->divider = divider;
    cs->conversion = conversionType;
    sensors[PDOID] = *cs;
    this->PDOs.push_back(PDOID);
    this->PDOsMap[PDOID] = key;
  }
  void register_textSensor(text_sensor::TextSensor *obj, std::string key, int PDOID, std::string (*convLambda)(uint8_t *) ) {
    ComfoSensor<text_sensor::TextSensor, std::string (*)(uint8_t *)> *cs = new ComfoSensor<text_sensor::TextSensor, std::string (*)(uint8_t *)>();
    cs->sensor = obj;
    cs->conversion = convLambda;
    textSensors[PDOID] = *cs;
    this->PDOs.push_back(PDOID);
    this->PDOsMap[PDOID] = key;
  }
  void register_binarySensor(binary_sensor::BinarySensor *obj, std::string key, int PDOID, bool (*convLambda)(uint8_t *) ) {
    ComfoSensor<binary_sensor::BinarySensor, bool (*)(uint8_t *)> *cs = new ComfoSensor<binary_sensor::BinarySensor, bool (*)(uint8_t *)>();
    cs->sensor = obj;
    cs->conversion = convLambda;
    binarySensors[PDOID] = *cs;
    this->PDOs.push_back(PDOID);
    this->PDOsMap[PDOID] = key;
  }
  /**
    * Send a command to the ComfoAir
    * @param command The command to send
    */
  void send_command(std::string command) {
    #define CMDIF(name) if (command == #name) { \
                          std::vector<uint8_t> cmd_data( CMD_ ## name ); \
                          this->sendVector(&cmd_data); \
                          delay(1000); \
                          this->sendVector(&cmd_data); \
                        } else
    CMDIF(ventilation_level_0)
    CMDIF(ventilation_level_1)
    CMDIF(ventilation_level_2)
    CMDIF(ventilation_level_3)
    CMDIF(boost_10_min)
    CMDIF(boost_20_min)
    CMDIF(boost_30_min)
    CMDIF(boost_60_min)
    CMDIF(boost_end)
    CMDIF(auto)
    CMDIF(manual)
    CMDIF(bypass_activate_1h)
    CMDIF(bypass_deactivate_1h)
    CMDIF(bypass_auto)
    CMDIF(ventilation_supply_only)
    CMDIF(ventilation_supply_only_reset)
    CMDIF(ventilation_extract_only)
    CMDIF(ventilation_extract_only_reset)
    CMDIF(temp_profile_normal)
    CMDIF(temp_profile_cool)
    CMDIF(temp_profile_warm)
    ;
  }
  void sendHex(std::string hexSequenceToSend) {
    std::vector<uint8_t> bytes;
    bytes.reserve(hexSequenceToSend.length() / 2);
    for (unsigned int i = 0; i < hexSequenceToSend.length(); i += 2) {
        std::string byteString = hexSequenceToSend.substr(i, 2);
        uint8_t byte = (uint8_t) strtol(byteString.c_str(), NULL, 16);
        bytes.push_back(byte);
    }
    this->sendRaw(bytes.size(), bytes.data());
  }
  void sendVector(std::vector<uint8_t> *data) {
    this->sendRaw(data->size(), data->data());
  }
  void sendRaw(uint8_t length, uint8_t *buf){
     sequence++;
     sequence = sequence & 0x3;
     CAN_FRAME message;
     message.extended = true;
     message.rtr = 0;

     if (length > 8) {
         CanAddress addr = CanAddress(0x3a, 0x1, 0, 1, 0, 1, this->sequence);
         uint8_t dataGrams = length / 7;
         if (dataGrams * 7 == length)  {
             dataGrams--;
         }
         for (uint8_t i = 0; i < dataGrams; i++) {
             memset(message.data.byte, 0, 8);
             message.data.uint8[0] = i;
             message.length = amin((i*7)+7, length) - i*7 + 1;

             message.id = addr.canID();
             memcpy(& message.data.uint8[1], &buf[i * 7], message.length - 1);
             CAN0.sendFrame(message);
         }
         // Send last packet
         memset(message.data.uint8, 0, 8);
         message.data.uint8[0] = dataGrams | 0x80;
         message.length = length - dataGrams * 7 + 1;
         memcpy(& message.data.uint8[1], &buf[dataGrams * 7], length - dataGrams * 7);
         CAN0.sendFrame(message);

     } else {
         CanAddress addr = CanAddress(0x3a, 0x1, 0, 0, 0, 1, this->sequence);
         message.id = addr.canID();
         message.length = length;
         memcpy(message.data.uint8, buf, length);
         CAN0.sendFrame(message);

     }
  }

  void setup() override{
     CAN0.setCANPins( (gpio_num_t) this->rx_, (gpio_num_t) this->tx_);
     CAN0.begin(50000);
     CAN0.watchFor();
     register_service(&Comfoair::send_command, "send_command", {"command"});
     register_service(&Comfoair::sendHex, "send_hex", {"hexSequence"});
     register_service(&Comfoair::req_update_service, "req_update_service", {"PDOID"});
     register_service(&Comfoair::update_next, "update_all", {});
     this->update_next();
  }

  void update_next() {
    if (update_iterator_ >= (int)PDOs.size()) {
        update_iterator_ = 0;
        if (!boot_recheck_done_) {
            // First pass done — schedule a second pass after 30s to fix
            // boot-time CAN artifacts (e.g. fan_speed PDO returning 0 briefly).
            boot_recheck_done_ = true;
            set_timeout("update_recheck", 30000, [this](){this->update_next();});
        }
        return;
    }

    int currentPDO = PDOs[update_iterator_];
    this->request_data(currentPDO);
    update_iterator_++;
    ESP_LOGD(TAG, "update_next %d - iterator %d", currentPDO, update_iterator_);
    set_timeout("update_next", 1000, [this](){this->update_next();});
  }
  void req_update_service(float pdo){
    this->request_data((int)pdo);
  }
  void request_data(int PDOID) {
//    CanAddress addr = CanAddress(0x3, 0x1, 0, 0, 0, 1, this->sequence);
    CAN_FRAME message;
    message.extended = true;
    message.rtr = 1;
    message.id = (PDOID << 14) + 0x40 + 0x3a;

    message.length = 0;
    CAN0.sendFrame(message);
  }

  void loop(){
    // ESP_LOGD(TAG, "loop");
    if (CAN0.read(canMessage)) {
        uint16_t PDOID = (canMessage.id & 0x01fff000) >> 14;
        uint8_t *vals = &canMessage.data.uint8[0];
        
        auto sensor_it = sensors.find(PDOID);
        if (sensor_it != sensors.end()) {
            const auto& el = sensor_it->second;
            float sensorVal;

            switch (el.conversion) {
                case 0: // UINT8
                    sensorVal = vals[0];
                    break;
                case 1: // UINT16
                    sensorVal = (vals[0] + (vals[1]<<8));
                    break;
                case 2: // UINT32
                    sensorVal = (vals[0] + (vals[1]<<8) + ((vals[2] + (vals[3]<<8))<<16));
                    break;
                case 3: // INT16
                    sensorVal = ((vals[1] < 0x80 ? (vals[0] + (vals[1] << 8)) : - ((vals[0] ^ 0xFF) + ((vals[1] ^ 0xFF) << 8) + 1)));
                    break;
            }
            if (el.divider > 1) {
                sensorVal = sensorVal / el.divider;
            }
            // PDO 65 (fan_speed) always returns 0 via RTR at boot; the real
            // value only arrives as a spontaneous TPDO when the speed changes.
            // Skip the zero until we've seen at least one non-zero reading so
            // we don't incorrectly set the climate fan_mode to OFF on restart.
            const std::string& sKey = PDOsMap.count(PDOID) ? PDOsMap[PDOID] : "";
            if (sKey == "fan_speed") {
                if (sensorVal == 0.0f && !fan_speed_initialized_) {
                    ESP_LOGD(TAG, "fan_speed: ignoring boot-time RTR zero (not yet initialized)");
                    return;
                }
                if (sensorVal > 0.0f) fan_speed_initialized_ = true;
            }
            el.sensor->publish_state(sensorVal);
            maybeUpdateClimate(PDOID, sensorVal);
        }

        // Checked independently (not else-if): a PDO can be registered in more
        // than one map at once (e.g. PDO 16 feeds both the "away" binary sensor
        // and the "device_state" text sensor). An else-if chain here would let
        // only the first-matching map ever receive updates for a shared PDO.
        bool matched = sensor_it != sensors.end();

        auto text_it = textSensors.find(PDOID);
        if (text_it != textSensors.end()) {
            matched = true;
            const auto& el = text_it->second;
            std::string val = el.conversion(vals);
            // len + raw are for troubleshooting: `canMessage` is a reused member
            // buffer, not cleared between reads. A frame shorter than the CAN
            // DLC below leaves the untouched higher-index bytes holding
            // whatever the previous CAN0.read() left there, not real zeros.
            ESP_LOGD(TAG, "textSensor pdo=%d name=%s value=%s len=%d raw=%02X%02X%02X%02X%02X%02X%02X%02X",
                     PDOID, el.sensor->get_name().c_str(), val.c_str(), canMessage.length,
                     vals[0], vals[1], vals[2], vals[3], vals[4], vals[5], vals[6], vals[7]);
            el.sensor->publish_state(val);
            maybeUpdateClimate(PDOID, val);
        }

        auto binary_it = binarySensors.find(PDOID);
        if (binary_it != binarySensors.end()) {
            matched = true;
            const auto& el = binary_it->second;
            el.sensor->publish_state(el.conversion(vals));
        }

        if (!matched) {
            // Catch-all for PDOs we don't map to any sensor yet — watch this
            // while reproducing an on-device error/warning to spot which PDO
            // (if any) it shows up on.
            ESP_LOGD(TAG, "unmapped pdo=%d len=%d raw=%02X%02X%02X%02X%02X%02X%02X%02X",
                     PDOID, canMessage.length,
                     vals[0], vals[1], vals[2], vals[3], vals[4], vals[5], vals[6], vals[7]);
        }
    }

  }

  void dump_config(){
  }

  void maybeUpdateClimate(int PDO, const std::string& newVal) {
    const std::string& sensorName = this->PDOsMap[PDO];
    if ("temp_profile" == sensorName) {
        if (newVal == "auto") {
            this->mode = climate::CLIMATE_MODE_AUTO;
        } else if (newVal == "cold") {
            this->mode = climate::CLIMATE_MODE_COOL;
        } else if (newVal == "warm") {
            this->mode = climate::CLIMATE_MODE_HEAT;
        }
        this->publish_state();
    }
  }

  void maybeUpdateClimate(int PDO, float newVal){
    const std::string& sensorName = this->PDOsMap[PDO];
//    ESP_LOGD(TAG, "maybeUpdateClimate %s %f", sensorName.c_str(), newVal);
    if ("fan_speed" == sensorName) {
        ESP_LOGD(TAG, "ibua %s %f", sensorName.c_str(), newVal);
        // Use integer comparison for discrete fan levels
        int fanLevel = static_cast<int>(newVal + 0.5f); // Round to nearest int
        if (fanLevel == 0) {
            this->fan_mode = (climate::CLIMATE_FAN_OFF);
        } else if (fanLevel == 1) {
            this->fan_mode = (climate::CLIMATE_FAN_LOW);
        } else if (fanLevel == 2) {
            this->fan_mode = (climate::CLIMATE_FAN_MEDIUM);
        } else if (fanLevel == 3) {
            this->fan_mode = (climate::CLIMATE_FAN_HIGH);
        }
        this->publish_state();
    } else if ("extract_air_temp" == sensorName) {
       this->current_temperature = newVal;
       this->publish_state();
    } else if ("extract_air_humidity" == sensorName) {
       this->current_humidity = newVal;
       this->publish_state();
    } else if ("target_temp" == sensorName) {
       this->target_temperature = newVal;
       this->publish_state();
    }
  }

  climate::ClimateTraits traits() override {
    auto traits = climate::ClimateTraits();
    traits.add_feature_flags(climate::CLIMATE_SUPPORTS_CURRENT_TEMPERATURE | climate::CLIMATE_SUPPORTS_CURRENT_HUMIDITY);
    traits.set_supported_modes({climate::CLIMATE_MODE_AUTO, climate::CLIMATE_MODE_COOL, climate::CLIMATE_MODE_HEAT});
    traits.set_supported_presets({climate::CLIMATE_PRESET_HOME});
    traits.set_visual_min_temperature(10);
    traits.set_visual_max_temperature(35);
    traits.set_visual_temperature_step(1);
    traits.set_supported_fan_modes({
      climate::CLIMATE_FAN_AUTO,
      climate::CLIMATE_FAN_LOW,
      climate::CLIMATE_FAN_MEDIUM,
      climate::CLIMATE_FAN_HIGH,
      climate::CLIMATE_FAN_OFF
    });
    return traits;
  }

  void control(const climate::ClimateCall &instruction) override {
    if (instruction.get_fan_mode().has_value()){
        switch (instruction.get_fan_mode().value()) {
            case climate::CLIMATE_FAN_AUTO:
            this->send_command("auto");
            break;
            case climate::CLIMATE_FAN_LOW:
            this->send_command("ventilation_level_1");
            break;
            case climate::CLIMATE_FAN_MEDIUM:
            this->send_command("ventilation_level_2");
            break;
            case climate::CLIMATE_FAN_HIGH:
            this->send_command("ventilation_level_3");
            break;
            case climate::CLIMATE_FAN_OFF:
            this->send_command("ventilation_level_0");
            break;
        }
    }
    if (instruction.get_mode().has_value()){
        switch (instruction.get_mode().value()) {
            case climate::CLIMATE_MODE_AUTO:
            this->send_command("temp_profile_normal");
            break;
            case climate::CLIMATE_MODE_COOL:
            this->send_command("temp_profile_cool");
            break;
            case climate::CLIMATE_MODE_HEAT:
            this->send_command("temp_profile_warm");
            break;
        }

    }
  }

 private:
  CAN_FRAME canMessage;

 protected:
  int rx_{-1};
  int tx_{-1};
  uint8_t sequence = 0;
  int update_iterator_ = 0;
  bool boot_recheck_done_ = false;
  bool fan_speed_initialized_ = false;
  /* List of PDOs to request */
  std::vector<int> PDOs;
  /* map between pdoid and string key */
  std::map<int, std::string> PDOsMap;
  std::map<int, ComfoSensor<sensor::Sensor, int>> sensors;
  std::map<int, ComfoSensor<text_sensor::TextSensor,  std::string (*)(uint8_t *)>> textSensors;
  std::map<int, ComfoSensor<binary_sensor::BinarySensor, bool (*)(uint8_t *)>> binarySensors;

};

} //namespace comfoair
} //namespace esphome
